# 将选择三种天赋的文案存储在变量talent_choice中
talent_choice = ["现有以下三种天赋可供选择：",
"1.中产离异家庭，乐观，网络狂魔",
"2.中法混血，超凡美貌，家道中落",
"3.早产儿，天资聪慧，生于乡村"]
# 将选择3种天赋所触发的剧情分别存储在变量talent_answer1,talent_answer2,talent_answer3中
talent_answer1 = ["4岁上幼儿园","5岁羡慕邻居一家三口去游乐场，而你只能在自己家的电影院独自看动画片","7岁老师在班上进行了IQ测试，你IQ平平","12岁努力学习的一年希望得到父亲的认可，但父亲只关注小三的儿子","13岁开始追星，在粉丝应援群中感受到了温暖","15岁考上重点中学，翘课去看爱豆演唱会，翻墙中摔断了腿","16岁收到第一封情书，开启了第一次恋爱","17岁爱豆被评为劣迹艺人，你哭着哭着秃头了","18岁遭遇初恋男友出柜，从此一心搞事业","20岁只身前往外国深造"]
talent_answer2 = ["3岁回到上海","5岁被星探挖掘，成为广告模特","6岁父亲欠下巨额债务并消失","7岁一边上学一边还债","9岁母亲运营自媒体账号，成为百万粉丝大V","10岁你被同班同学霸凌","12岁抑郁没考上中学","13岁在家修养一年，爱上画画","15岁一边学画画一边做模特","16岁回到学校，再次成为话题人物","17岁终于还清父亲欠下的债务","18岁搬家到成都","19岁以艺术生的方式考入大学","20岁和当红流量明星一起拍广告"]
talent_answer3 = ["刚出生父母双亡","3岁吃不起拉面，被预言是天选之子","6岁用放大镜对着太阳，把家里的院子烧了","9岁用弹弓打马蜂窝，蛰了自己一脸包","12岁以优异的成绩前往县城读中学","18岁考上名牌大学，成为全村的骄傲","19岁沉迷网游无法自拔，和名叫“阿美”网游恋爱","21岁网游面基发现对方和自己同为男性，一气之下戒了网瘾"]

# 将选择“逐梦天涯”的剧情分别存储在变量choice1_talent1，choice1_talent2，choice1_talent3中
choice1_talent1 = ["23岁毕业，选择留美生活","25岁和同学一起创业，不断打怪升级","30岁公司做大做强，逐步实现财富自由","33岁拒绝了合伙人的求婚，去澳门赌场消费一个亿","35岁领养了一个10岁的小男孩，并取了初恋的名字","40岁，小三的儿子赌博，你拒绝帮他还债，并暴打他一顿","50岁重回祖国，在乡下买了块土地，种的西瓜被当地人偷了","60岁儿子宣布出家当和尚，放弃继承家业","65岁住进了养老院，和老太太因为当红明星谁最帅而大打出手","70岁患了癌症","71岁在睡梦中平静离世"]
choice1_talent2 = ["21岁和顶流拍广告成为话题女星","23岁放弃学业参加选秀","25岁出演偶像剧女主，但剧情拉垮被网友嘲讽","26岁和男明星隐婚生子","27岁离婚成为单亲妈妈","28岁，回法国学设计","32岁开设亲子服装网店","35岁在8个城市开了超过30家店铺","38岁财务自由","40岁儿子在学校遭遇校园霸凌","42岁成立基金会，帮扶被霸凌的儿童","44岁投资并参演校园霸凌题材的电影","45岁遭遇疫情，关闭20家实体店铺","50岁资产缩水但没有减少公益投入","60岁儿子去教堂当神父，你表示支持","70岁在海边别墅平静离开"]
choice1_talent3 = ["23岁和朋友炒期货，赚了人生第一桶金","24岁迷上了喝奶茶，利用第一桶金开了奶茶店","26岁奶茶店火了，你把业务拓展到了海外","30岁因长期喝太多奶茶，得了过度肥胖症","32岁努力减肥，重新变为帅小伙","40岁回到家乡，建设美丽乡村"]

# 将选择“找份安稳工作”的剧情分别存储在变量choice2_talent1，choice2_talent2，choice2_talent3中
choice2_talent1 = ["23岁研究生毕业选择回国发展","24岁被家长催考公务员","25岁考上地方财政局，成为父亲酒局上最大的谈资","27岁拒绝了所有相亲，成为恐婚一族","30岁下乡支教","31岁被同为支教老师的同事温暖，结婚，老公话不多但顾家","33岁老公希望你们有个孩子，但你坚决不生","35岁买了第二套房，同年生下龙凤胎","40岁老公冲动创业亏了一套","45岁每天下班鸡娃","女儿学霸儿子学渣","60岁退休给儿子带娃","65岁给女儿带娃","70岁国家补贴3胎家庭每月2万","75岁癌症已被攻克","80岁老伴离世","你吃斋念佛活到99"]
choice2_talent2 = ["21岁放弃演艺圈生活，安心读书","22岁进入传媒公司打工","25岁连升2级成为部门主管","27岁你养了1只猫咪","29岁你养了8只猫咪","32岁传媒公司不景气被裁员","33岁开启了自己的网店，并进行开启直播卖货","35岁因为直播卖货大火，成为某宝首席主播","40岁因常年高强度工作，身患乳腺癌","45岁癌症治愈，开始加入流浪宠物公益组织","60岁创立了流浪动物保护组织","70岁，在社会各界的赞扬声中安然去世"]
choice2_talent3 = ["23岁为资本家打工，天天996","27岁凭借996的超高薪资，为父母在乡村买了大房子，并资助了两个穷苦大学生","35岁失业，在原公司楼下卖手抓饼","50岁发现当年资助的学生如今成为大学教授，每个月都来看望你"]

# 游戏开篇设置

# 游戏开篇显示游戏标题
# 导入time模块
import time
# 打印30个"*"
print("*"*30)
# 停顿1s
time.sleep(1)  
print(" "*5+"人生选择模拟器")
# 再停顿1s
time.sleep(1)
# 再打印30个"*"
print("*"*30)

# 使用input()函数接收玩家输入名字，并将输入的名字赋值给变量name
name = input("在输入框中给自己取一个名字吧：")
# 使用print()函数格式化输出f"好的，谢谢你{name}"
print(f"好的，谢谢你{name}")

# 第一个剧情点；天赋选择

# TODO 导入time模块
import time

# for循环依次输出变量talent_choice中存储的内容
for i in talent_choice:  
    # 每次输出前，停顿2秒
    time.sleep(2)
    # 输出元素
    print(i)
# 使用input()函数等待玩家输入选择的天赋，使用int()函数转化为整型，并赋值给变量talent
talent = int(input("请选择一种天赋："))

# TODO 定义get_list函数，参数为list，s作用是依次获取列表list中的元素并输出，每次输出前停顿s秒
def get_list(list,s):
    # 函数主体部分：依次从列表中提取元素
    for i in list:
        # TODO 每次输出前，停顿s秒
        time.sleep(s)
        # 输出元素
        print(i)
# 使用if elif else条件判断，判断选择的天赋并输出相应的剧请
if talent == 1:
    # TODO 调用get_list函数，设置参数为天赋1对应的剧情talent_answer1，停顿秒数为1秒
    get_list(talent_answer1,1)
elif talent == 2:
    get_list(talent_answer2,1)
elif talent == 3:
    get_list(talent_answer3,1)
else:
    print("输入错误，请重新检查代码") 

# 第二个剧情点：成年后的选择


# 使用input()函数接收选择，并将选择的内容存储到变量choice中，并使用int()函数将输入的内容转化为整型
choice = int(input("成年后你面临两种选择：1.逐梦天涯  2.找一份安稳的工作，你的选择是：")) 

# 使用if elif else条件判断，判断玩家选择逐梦天涯时（choice == 1）输出对应玩家天赋的剧情
if choice == 1:
    # 输出"你选择了逐梦天涯。"
    print("你选择了逐梦天涯。")
    # 判断当天赋选择为1时
    if talent == 1:
        # 调用get_list函数依次输出choice1_talent1中的剧情
        get_list(choice1_talent1,1)
        print("达成成就:商业传奇")
    # 判断当天赋选择为2时
    elif talent ==2:
        # 调用get_list函数依次输出choice1_talent2中的剧情
        get_list(choice1_talent2,1)
        print("达成成就:娱乐公益之星")
    # 判断当选择情况为3时    
    elif talent ==3:
        # 调用get_list函数依次输出choice1_talent3中的剧情
        get_list(choice1_talent3,1)
        print("达成成就:追梦强者")
# 使用条件判断，判断玩家选择安稳工作时（choice == 2）输出对应天赋的剧情
elif choice == 2:
    # 输出"你选择了找一份安稳工作。"
    print("你选择了找一份安稳工作。")
    # 判断当天赋选择为1时
    if talent == 1:
        # 调用get_list函数依次输出choice2_talent1中的剧情
        get_list(choice2_talent1,1)
        print("达成成就:安稳一生")
    # 判断当天赋选择为2时   
    elif talent ==2:
        # 调用get_list函数依次输出choice2_talent2中的剧情
        get_list(choice2_talent2,1)
        print("达成成就:职场爱心人")
    # 判断当选择情况为3时    
    elif talent ==3:
        # 调用get_list函数依次输出choice2_talent3中的剧情
        get_list(choice2_talent3,1)
        print("达成成就:打工人与善举者")
else:
    print("输入错误，请重新检查代码") 
